# RiseRunFromDeg

## Description
Converts slope from degrees to rise-over-run string.

```pascal
FUNCTION RiseRunFromDeg(fSlopeDeg : REAL): STRING;
```

```python
def vs.RiseRunFromDeg(fSlopeDeg):
    return STRING
```

## Parameters
|Name|Type|Description|
|---|---|---|
|fSlopeDeg|REAL|   |

## Version
Availability: from Vectorworks 2016

## Category
* SiteModel Interface Library